[
    {
        "title": "AI startup Cohere acquires Ottogrid, a platform for conducting market research",
        "summary": "AI startup Cohere has acquired Ottogrid, a Vancouver-based platform that develops enterprise tools for automating certain kinds of high-level market research.",
        "content": "AI startup Cohere has acquiredOttogrid, a Vancouver-based platform that develops enterprise tools for automating certain kinds of high-level market research. Sully Omar, one of the founders of Ottogrid, announced the deal Friday in apost on X. He didn’t disclose the terms. Ottogrid will sunset its product, according to Omar, but will give customers “ample notice” and “a reasonable transition period.” “We’re very excited to join the Cohere team and integrate Ottogrid into Cohere’s … platform,” Omar said in a statement. “Through our work with Cohere, we’re [going to] dramatically impact how people can automate their workflows, enrich their data, and scale their operations.” Cohere didn’t immediately respond to a request for comment. Cohere’s purchase of Ottogrid comes as the former experiences a bit of corporate turbulence.According to The Information, Cohere fell well short of revenue projections the company prepared in early 2023, missing its target for last year by 85%. The companytold Reuterson Thursday that its annualized revenue recently reached $100 million, following a strategic shift with a focus on private AI deployments for customers in sectors like healthcare, government, and finance. Ottogrid launched in 2023 as Cognosys, led by Omar and Homam Malkawi. It rebranded in October 2024 with a major platform redesign that introduced a number of new integrations, tools, and APIs. Today, Ottogrid offers a “native table interface” with AI-powered document analysis capabilities. Customers can use it to extract data from a website and save it directly to a spreadsheet, for example, or automatically enrich sales lead lists. Ottogrid managed to raise $2 million in venture capital from investors, including GV (Google Ventures), Untapped Capital, Replit CEO Amjad Masad, Vercel CEO Guillermo Rauch, Cohere co-founders Ivan Zhang and Aidan Gomez, and others prior to its exit,according to Crunchbase. As part of Cohere, Omar says that Ottogrid will focus primarily on North, Cohere’s recently launched ChatGPT-style application designed to assist knowledge workers with tasks such as summarizing documents. Updated 2:03 p.m. Pacific: In a statement, Cohere CEO Aidan Gomezsaid:“I’m super excited to bring the Ottogrid team aboard and incorporate Ottogrid’s product directly into North. We’re bringing enterprises a new way to tackle research with smart tables, helping make employees’ day-to-day work more enjoyable and productive.”",
        "date_published": "2025-05-16T12:57:53-07:00",
        "source_url": "https://techcrunch.com/2025/05/16/ai-startup-cohere-acquires-ottogrid-a-platform-for-conducting-market-research/"
    },
    {
        "title": "Arc’s new 24-foot electric boat is its cheapest yet",
        "summary": "Electric boat startup Arc has a new model that is its cheapest and most approachable watercraft yet. The new boat is called the Arc Coast, and it will",
        "content": "Electric boat startup Arc has a new model that is its cheapest and most approachable watercraft yet. The new boat is called the Arc Coast, and it will start at $168,000. The company is taking preorders now and says the Coast will ship in 2026. The Coast is what’s known as a “center console” boat, which is often used for fishing. It’s the company’s third model, following the limited edition $300,000 Arc One and the $268,000 Arc Sport (whichI got to pilot earlier this year). That’s despitecoming out of stealth just four years ago. Arc also recently announced it’s working on an electrictug boatto be used at the Port of Los Angeles, as the startup tries to make good on founder and CEO Mitch Lee’s ambitious promise to electrify all watercraft. The company says the Coast is powered by the same 226kWh battery pack Arc designed for the Sport and is roughly the same size. That battery should last for hours — four to five, or even more, depending on how much drivers use the 400 horsepower on offer — and can power the Coast up to around 50 miles per hour. Up to 10 people can ride on board. The big difference between the Coast and the Sport, other than price, is the layout. True to its name, the “console” or helm of the boat is situated in the center, allowing for freer movement around the edges. It appears to have the same fit and finish of Arc’s other boats, which looked superb even on the production-intent Sport I drove in January. Arc has also put a lot of work into the software on the center console’s screens, which are minimalist yet rich with information. Add in all the other upsides over gas boats like no fumes, no winterization, and less noise, and it’s possible to imagine people justifying what is still an eye-watering price tag when it hits the market next year.",
        "date_published": "2025-05-16T12:05:05-07:00",
        "source_url": "https://techcrunch.com/2025/05/16/arcs-new-24-foot-electric-boat-is-its-cheapest-yet/"
    },
    {
        "title": "OpenAI launches Codex, an AI coding agent, in ChatGPT",
        "summary": "OpenAI has launched an AI agent in ChatGPT, Codex, that can handle multiple software engineering tasks on behalf of users simultaneously.",
        "content": "OpenAI announced on Friday it’s launching a research preview of Codex, the company’s most capable AI coding agent yet. Codex is powered by codex-1, a version of the company’so3 AI reasoning modeloptimized for software engineering tasks. OpenAI says codex-1 produces “cleaner” code than o3, adheres more precisely to instructions, and will iteratively run tests on its code until passing results are achieved. The Codex agent runs in a sandboxed, virtual computer in the cloud. By connecting with GitHub, Codex’s environment can come preloaded with your code repositories. OpenAI says the AI coding agent will take anywhere from one to 30 minutes to write simple features, fix bugs, answer questions about your codebase, and run tests, among other tasks. Codex can handle multiple software engineering tasks simultaneously, says OpenAI, and it doesn’t limit users from accessing their computer and browser while it’s running. Codex is rolling out starting today to subscribers to ChatGPT Pro, Enterprise, and Team. OpenAI says users will have “generous access” to Codex to start, but in the coming weeks, the company will implement rate limits for the tool. Users will then have the option to purchase additional credits to use Codex, an OpenAI spokesperson tells TechCrunch. OpenAI plans to expand Codex access to ChatGPT Plus and Edu users soon. AI tools for software engineers, also known as vibe coders, have surged in popularity in recent months. The CEOs ofGoogleandMicrosoftclaim that roughly 30% of their companies’ code is now written by AI. In February, Anthropic released its own agentic coding tool,Claude Code, and in April, Google updated its AI coding assistant,Gemini Code Assist, with more agentic abilities. All that vibe coding has made the businesses behind AI coding platforms some of the fastest-growing in tech. Cursor, among the most popular AI coding tools, reached annualized revenue of around$300 millionin April and isreportedly raising new funds at a $9 billion valuation. Now, OpenAI wants a piece of the pie. The ChatGPT maker has reportedlyclosed on a deal to acquire Windsurf, the developer behind another popular AI coding platform, for $3 billion. The launch of Codex shows very clearly that OpenAI is building out its own AI coding tools, in addition. Users with access to Codex can find the tool in ChatGPT’s sidebar, and assign the agent new coding tasks by typing a prompt and clicking the “Code” button. Users can also ask questions about their codebase and click the “Ask” button. Below the prompting bar, users can see other tasks they’ve assigned Codex to do, and monitor their progress. In a briefing ahead of Codex’s launch, OpenAI’s Agents Research Lead, Josh Tobin, told TechCrunch the company eventually wants its AI coding agents to act as “virtual teammates,” completing tasks autonomously that take human engineers “hours or even days” to accomplish. OpenAI claims it’s already using Codex internally to offload repetitive tasks, scaffold new features, and draft documentation. OpenAI Product Lead Alexander Embiricos says a lot of the safety work for the company’s o3 model applies to Codex as well. In a blog post, OpenAI says Codex will reliably refuse requests to develop “malicious software.” Furthermore, Codex operates in an air-gapped environment, with no access to the broader internet or external APIs. This limits how dangerous Codex could be in the hands of a bad actor — but it may also hamper its usefulness. It’s worth noting that AI coding agents, much like all generative AI systems today, are prone to mistakes. Arecent study from Microsoftfound that industry-leading AI coding models, such as Claude 3.7 Sonnet and o3-mini, struggled to reliably debug software. However, that doesn’t seem to be dampening investor excitement in these tools. OpenAI is also updatingCodex CLI,the company’s recently launched open source coding agent that runs in your terminal, with a version of itso4-minimodel that’s optimized for software engineering. That model is now the default in Codex CLI, and will be available in OpenAI’s API for $1.50 per 1M input tokens (roughly 750,000 words, more than the entire Lord of the Rings book series) and $6 per 1M output tokens. Codex’s launch marks OpenAI’s latest effort to beef up ChatGPT with additional products besides the notorious chatbot. In the past year, OpenAI has added priority access to the company’s AI video platform,Sora, its research agent,Deep Research, as well as its web browsing agent,Operator, as benefits for subscribers. These offerings could entice more users to sign up for a ChatGPT subscription, and, in the case of Codex specifically, convince existing subscribers to pay OpenAI more money for increased rate limits.",
        "date_published": "2025-05-16T08:00:00-07:00",
        "source_url": "https://techcrunch.com/2025/05/16/openai-launches-codex-an-ai-coding-agent-in-chatgpt/"
    },
    {
        "title": "Spotify responds to backlash over public podcast play counts",
        "summary": "Spotify rolled back an announcement that it would display play counts on podcast episodes; instead, counts will only appear after 50k plays.",
        "content": "Spotifyannouncedlast week that it would roll out public play counts on all podcasts as a way of “helping attract new fans.” But podcasters swiftly responded with criticism of the new feature — mainly, that it would further promote podcasts that already have large audiences while making smaller shows less appealing to new listeners. On Friday, Spotifychanged courseon its plans, but did not completely eschew the idea. Now, play counts will only appear on shows with at least 50,000 plays each. Instead of showing an exact play count, the designation will only update at specific milestones, like 100,000 or 1 million plays. “We plan to roll this newly evolved version of play counts over the coming week,” the company wrote in ablog post. “This update reflects our evolving efforts to provide the best insights for creators and a clear experience for their fans.” For decades, podcast hosting platforms have not shared many public indicators of a show’s popularity — Apple Podcasts, for example, has had reviews and charts on its app, but it would be challenging for a listener to know if a show had an audience in the tens or the tens of thousands. Though Spotify takes the angle that this ambiguity is a detriment, creators have been drawn to the podcasting medium in part because it’s refreshingly different from other forms of online media. When someone clicks play on a YouTube video, for example, they are approaching the media with the existing knowledge of how many views the video has, and how many people have subscribed to that channel. But podcasting can level the playing field for more niche creators. Podcasters have also expressed frustration with the lack of a clear metric for what counts as a “play” or a “stream” among various different platforms. The Interactive Advertising Bureau (IAB) works with podcast platforms to establish a clear metric for what is defined as a “play,” creating more consistency for dealmaking among podcasters and advertisers. But according toPodnews, the definition of what counts as a “play” is different on Spotify and YouTube — two of the most popular podcast listening platforms — than the IAB standard. Spotify said that play counts will refer to the number of times “people actively tried” the content, whereas streams and downloads only count after 60 seconds of engagement. ",
        "date_published": "2025-05-16T08:31:52-07:00",
        "source_url": "https://techcrunch.com/2025/05/16/spotify-responds-to-creator-backlash-at-public-podcast-play-counts/"
    },
    {
        "title": "Epic Games says Apple is blocking Fortnite from the US and EU App Stores",
        "summary": "Epic Games claims that Apple is blocking its Fortnite app from the U.S. and EU App Stores. After winning a decisive victory for app developers in a legal",
        "content": "Epic Games claims that Apple is blocking its Fortnite app from the U.S. and EU App Stores. Afterwinning a decisive victory for app developersin a legal battle with Apple, forcing the tech giant to allow external payments in its U.S. App Store without charging commission, Epic Games attempted toresubmit Fortnite to the U.S. App Storeon May 9, 2025. However, Apple failed to accept its submission for a week, leading Epic Games to pull its request and try again. According to Epic Games CEO Tim Sweeney, theupdate was pulled becauseEpic Games needs to release a weekly Fortnite update with new content, and all platforms must be updated simultaneously. The company then submitted a new version to the U.S. App Store for review on Wednesday, May 14, with the updated content. In a Friday morning post on X, Fortnite said that Apple has blocked its latest U.S. submission and has made it so Epic Games can’t release its app to the European Union, either. “Now, sadly, Fortnite on iOS will be offline worldwide until Apple unblocks it,” thepost from Fortnite reads. TechCrunch reached out to Epic Games and Apple for comment. Apple disputed Epic Games’ characterization of the issue. A spokesperson for Apple said the following: “We asked that Epic Sweden resubmit the app update without including the U.S. storefront of the App Store so as not to impact Fortnite in other geographies. We did not take any action to remove the live version of Fortnite from alternative distribution marketplaces in the EC.” Updated after publication with Apple’s comment.  ",
        "date_published": "2025-05-16T06:44:28-07:00",
        "source_url": "https://techcrunch.com/2025/05/16/epic-games-says-apple-is-blocking-fortnite-from-the-us-and-eu-app-stores/"
    }
]